call plug#begin()
Plug 'junegunn/fzf', { 'do': { -> fzf#install() } }
Plug 'junegunn/fzf.vim'
Plug 'jlcrochet/vim-ruby'
Plug 'vieira/vim-javascript'
Plug 'airblade/vim-gitgutter'
Plug 'voldikss/vim-floaterm'
Plug 'neoclide/coc.nvim', {'branch': 'release'}
Plug 'ryanoasis/vim-devicons'
Plug 'mhinz/vim-startify'
Plug 'vim-airline/vim-airline-themes'
Plug 'vim-airline/vim-airline'
Plug 'http://github.com/tpope/vim-surround' " Surrounding ysw)
Plug 'https://github.com/preservim/nerdtree', { 'on': 'NERDTreeToggle' } |
      \ Plug 'Xuyuanp/nerdtree-git-plugin'
Plug 'https://github.com/ap/vim-css-color' " CSS Color Preview
Plug 'https://github.com/tpope/vim-commentary' " For Commenting gcc & gc
Plug 'prettier/vim-prettier', { 'do': 'npm install' }

call plug#end()

"Use 24-bit (true-color) mode in Vim/Neovim when outside tmux.
"If you're using tmux version 2.2 or later, you can remove the outermost $TMUX check and use tmux's 24-bit color support
"(see < http://sunaku.github.io/tmux-24bit-color.html#usage > for more information.)
if (empty($TMUX) && getenv('TERM_PROGRAM') != 'Apple_Terminal')
  if (has("nvim"))
    "For Neovim 0.1.3 and 0.1.4 < https://github.com/neovim/neovim/pull/2198 >
    let $NVIM_TUI_ENABLE_TRUE_COLOR=1
  endif
  "For Neovim > 0.1.5 and Vim > patch 7.4.1799 < https://github.com/vim/vim/commit/61be73bb0f965a895bfb064ea3e55476ac175162 >
  "Based on Vim patch 7.4.1770 (`guicolors` option) < https://github.com/vim/vim/commit/8a633e3427b47286869aa4b96f2bfc1fe65b25cd >
  " < https://github.com/neovim/neovim/wiki/Following-HEAD#20160511 >
  if (has("termguicolors"))
    set termguicolors
  endif
endif

" Créer une commande pour naviguer entre les lignes modifiées dans Git
command! -nargs=0 GitModifiedLines :execute "silent! !git diff --unified=0 --no-color | grep -E '^\+|\-\+|^@@' | sed 's/^+//' | sed -n -e 's/^@@.*@@/\"/p' | tr -d '\"' | vim -"

" Mapper une touche (par exemple F8) pour appeler la commande GitModifiedLines
nnoremap <F8> :GitModifiedLines<CR>

inoremap <silent><expr> <TAB>
      \ coc#pum#visible() ? coc#pum#next(1) :
      \ CheckBackspace() ? "\<Tab>" :
      \ coc#refresh()
inoremap <expr><S-TAB> coc#pum#visible() ? coc#pum#prev(1) : "\<C-h>"
inoremap <silent><expr> <CR> coc#pum#visible() ? coc#pum#confirm(): "\<C-g>u\<CR>\<c-r>=coc#on_enter()\<CR>"
inoremap <silent><expr> <c-@> coc#refresh()

let &t_SI = "\e[6 q"
let &t_EI = "\e[2 q"


syntax on
filetype plugin on
set autoindent
colorscheme gruvbox
set wildmenu
set showcmd
set smarttab
set wrap
set ruler
set mouse=a
set nu
set rnu
set bg=dark
set incsearch
set incsearch smartcase
set hlsearch
set tabstop=2
set shiftwidth=2
set expandtab
set encoding=UTF-8
set signcolumn=yes
set colorcolumn=80
set updatetime=250

autocmd BufNewFile,BufRead *.es6 set filetype=javascript
autocmd BufNewFile,BufRead *.scss.erb set filetype=css
autocmd BufNewFile,BufReadpost *.rb setfiletype ruby
autocmd BufEnter * lcd %:p:h

let g:NERDTreeGitStatusIndicatorMapCustom = {
                \ 'Modified'  :'🍖',
                \ 'Staged'    :'✚',
                \ 'Untracked' :'🤡',
                \ 'Renamed'   :'➜',
                \ 'Unmerged'  :'═',
                \ 'Deleted'   :'✖',
                \ 'Dirty'     :'⚔️ ',
                \ 'Ignored'   :'☒',
                \ 'Clean'     :'✔︎',
                \ 'Unknown'   :'💣',
                \ }

let g:airline#extensions#tabline#left_sep = ' '
let g:airline#extensions#tabline#left_alt_sep = '|'
let g:airline#extensions#tabline#enabled = 1
let g:airline_powerline_fonts = 1
let g:coc_disable_startup_warning = 1
let g:NERDTreeWinSize=69
let g:airline_powerline_fonts = 1
let g:webdevicons_enable_airline_tabline = 1
let g:webdevicons_enable_airline_statusline = 1
let g:webdevicons_enable_startify = 1
let g:prettier#config#config_files = ['~/playr_code/.prettierrc', '~/playr_code/.prettierignore', '~/playr_code/.jscsrc', '~/playr_code/.jshintrc', '~/playr_code/.editorconfig']
let g:NERDTreeGitStatusUseNerdFonts = 1 " you should install nerdfonts by yourself. default: 0
let g:NERDTreeGitStatusConcealBrackets = 1 " default: 0
let g:loaded_scrollbar=1
let g:airline_theme='murmur'
let g:prettier#config#single_quote = 'true'
let g:prettier#config#trailing_comma = 'all'
let g:coc_global_extensions = ["coc-json","coc-git", "coc-eslint", "coc-prettier", "coc-tsserver", "coc-html"]

let g:startify_custom_header = [
      \ '          ⡴⠁⠀⢌⠉⠀⠀⠀⡀⠀⡀⠀⡀⠸⡀⠀⠀⠀⣰⣴⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠂⠀⠂⠀⠐⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀' ,
      \ '          ⠀⠀⠀⣈⣱⣤⡀⠀⠙⢦⣳⡀⢻⡄⠁⠀⠀⡼⠃⠀⠉⠚⢦⣄⡀⣆⠀⠀⠀⠀⠀⣀⡀⠀⠀⠀⠃⠰⠀⠀⢰⠃⠀⣠⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠀' ,
      \ '          ⣀⣶⣿⣿⣗⣋⣉⣀⠀⠀⡇⢳⡀⢧⠀⢀⡾⠀⠀⠀⠀⠀⠀⠀⠉⠉⠛⣶⡶⠞⠉⠁⠀⠀⣀⠀⠀⠀⠀⢀⡆⣠⠎⢁⣤⡐⠀⠀⠀⠀⢀⣴⠀⢠⡆⠀⠀⠀⠀⠀⠀⠀⢀⠆⠀' ,
      \ '          ⣿⣿⣻⣿⣿⣻⠿⠋⠀⠀⢧⠀⠹⠄⠀⡞⠀⠀⠀⠀⢀⡖⠀⠀⢀⣤⣾⡥⣴⣖⡶⠖⣿⠞⢁⣠⡤⠾⠀⣾⣰⠋⢰⡊⠀⠀⠀⠀⠀⢀⡾⠁⣠⠏⢀⡠⠔⠀⢀⠄⠀⡠⠃⠀⠀' ,
      \ '          ⢻⣽⣿⣿⣭⣥⣀⣠⠀⠀⠸⡆⠀⠀⣾⠀⠀⠀⠀⢠⡞⠀⠀⠀⠈⠹⠛⠋⠉⠀⣠⡾⠗⠚⣋⡭⠿⠶⣦⣯⣿⣀⠀⢿⡀⠀⠀⠀⣴⡟⢁⡼⠋⣴⠟⣁⣤⠞⠁⢀⡴⠁⡠⠔⠚' ,
      \ '          ⠀⢻⣿⣿⡯⣴⡟⠛⣧⠀⠀⠙⠄⢰⠁⠀⠀⠀⢠⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠘⠙⢠⡶⠛⠉⠀⠀⠀⠈⠈⠙⠻⣷⣬⣷⣄⠀⠀⢻⡷⠤⣤⣤⣥⣤⣭⣥⣤⣤⣈⣀⠀⠠⠔⠚' ,
      \ '          ⠀⠀⢈⣭⣶⠏⣿⣿⠘⡇⠀⠀⠀⡎⠀⠀⠀⣰⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⡻⠿⣷⣆⠸⡇⠀⠈⣿⡄⠀⠀⠀⠀⠀⠀⣸⡇⠀⠀⠀' ,
      \ '          ⣴⣾⣿⣿⡿⣼⢹⣿⠀⣷⢠⣄⣼⠁⠀⢠⡾⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠘⢿⢿⣧⠀⠀⣿⠃⢀⡀⠀⠀⠀⠀⣾⡇⠀⠒⠉' ,
      \ '          ⣿⣿⣿⣿⡇⠁⢸⣿⣶⡿⣼⠀⠉⢄⣀⣡⠤⠤⠤⣀⠀⠀⠀⠀⠐⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⢠⠄⠀⠀⠀⠀⠘⠃⠉⠀⠀⣿⠀⠀⣿⠀⠀⠀⠀⣿⡇⢀⣠⡴' ,
      \ '          ⣿⣿⣿⣿⡇⠀⣾⢻⣿⣷⡇⠀⠀⠀⠁⢀⣀⡀⠀⠈⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⣠⡟⠀⠀⠀⠀⠀⠀⡆⠀⠀⠀⣿⠀⢸⡟⠀⠀⠀⠀⡿⢈⣫⣥⠤' ,
      \ '          ⣿⣿⣿⣿⡇⠀⡏⣼⢹⣮⠃⠀⠀⠀⣤⠀⢉⠉⠑⠻⣾⣦⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⣠⡾⠋⠀⠀⠀⠀⠀⠀⠀⡇⠂⠀⠀⡏⢀⣸⣧⠀⠀⠀⣼⠇⠈⠉⠀⣰' ,
      \ '          ⣿⣿⣿⣿⣧⠀⣷⡏⢸⢸⠀⠀⠀⠀⢿⠕⢦⣙⠲⣄⡀⠈⢇⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠆⠀⠀⢠⡾⢋⡴⠃⠀⠀⠀⠀⠀⠀⢀⡇⠀⠀⢸⡇⠀⢸⣯⠀⠀⢰⣿⣠⠶⢾⣿⡿' ,
      \ '          ⢻⣿⣿⣿⣿⡄⠹⣇⣼⣾⠀⠀⠀⠀⠘⣇⠀⠛⢷⣦⣙⠲⢌⣧⡀⠀⠀⠀⠀⠀⠘⣿⣿⠀⠀⢠⡟⣡⡿⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃⠀⢀⣾⠇⠀⠀⢿⡄⢠⣾⠇⣡⠶⠛⢉⡀' ,
      \ '          ⣸⣿⣿⣿⣿⣿⡀⠘⣿⡇⠀⠀⠀⠀⠀⠘⣦⡀⠘⠿⠿⠿⡦⣿⣷⣄⠀⠀⠀⠀⠀⣿⠁⠀⢠⡟⣰⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⣠⡿⠻⣦⡀⠀⠈⣳⣿⡟⢀⣬⣼⣿⣻⣥' ,
      \ '          ⣿⣿⣿⣿⠟⠈⣧⡀⣿⡇⠀⠀⠀⠀⠀⠀⠈⠙⠶⣤⣄⣀⡈⠈⠹⣿⣦⡀⠀⢀⣤⠁⠀⢠⣿⡴⠋⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣾⠞⠉⠀⠀⠈⠻⣦⡈⡹⢿⡿⣿⣿⣿⡿⣟⣙' ,
      \ '          ⣿⣿⡟⠁⠀⠀⠘⣷⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣤⡭⢭⣿⣿⣿⣷⣶⣿⡏⠀⠀⣾⣼⠁⠀⠀⠀⠀⠀⢀⣤⡴⠞⠋⢻⡟⠳⣶⣄⡀⠀⠀⠈⠉⠀⢀⣿⣿⡿⣿⣿⣿⣽' ,
      \ '          ⠛⠋⠀⠀⠀⠀⠀⢻⣿⡃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠳⠶⣮⣋⣉⣻⣿⣇⠀⠀⠀⣿⣽⣧⣀⣤⣶⣶⣿⣯⣁⣀⣀⢀⣿⠁⠀⢀⣹⣿⡀⠀⠀⠀⢨⣿⣿⣿⣿⣿⣿⣿⣿' ,
      \ '          ⠀⠀⠀⠀⠀⠀⠀⢸⡟⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⢉⡟⠀⢀⣾⠿⠿⢿⡿⢿⣾⣿⣿⣷⣭⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠀⠀⣰⣿⣿⡿⣿⣿⣿⣷⣽⣿' ,
      \ '          ⠀⠀⠀⠀⠀⠀⠀⢸⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠃⠀⣾⠇⠀⠀⠀⠀⣄⠙⢿⠿⠯⢿⣿⣿⣿⡿⠿⠛⠋⠁⠀⠀⠁⢄⣾⣿⣿⢱⣿⣿⣿⣏⣿⣿' ,
      \ '          ⠀⠀⠀⠀⠀⠀⠀⢸⣿⡆⠀⠀⠀⡖⢖⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡇⠀⣼⠋⠀⠀⠀⠀⠀⢸⣟⠛⠓⠀⠀⠈⡽⠛⠛⣷⡀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿' ,
      \ '          ⠀⠀⠀⠀⠀⠀⠀⣿⡏⢻⠀⠀⠀⠀⠸⡷⢤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠀⢠⡿⠃⠀⠀⠀⠀⠀⠈⠻⣄⠀⠀⠀⡼⢁⣤⠾⠋⠀⠀⠀⠀⠀⣾⣿⣿⣿⡿⢿⣿⣿⣿⣿⣿⣿' ,
      \ '          ⠤⠤⠤⠤⠤⠤⠶⢿⡧⢬⣧⣄⣀⣀⣀⣳⡀⡿⢶⣄⡀⠀⠀⠀⠀⢤⣴⡇⣠⡾⠀⡀⠀⠀⠀⠀⠀⠀⠀⠹⣆⣠⡼⣿⠋⠁⠀⠀⠀⠀⠀⠆⣴⣿⡿⣻⣥⣿⣿⣿⣿⣿⣿⣿⣿' ,
      \ '          ⠀⠒⠀⠀⠀⠘⢻⣿⠋⠙⢿⣏⠉⠛⠛⠛⢿⠳⣄⡈⠛⠳⢤⣄⣀⠐⣷⣛⣭⡶⠿⠛⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠁⠀⣤⣄⡀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿' ,
      \ '          ⠀⠀⠀⠀⠀⠐⢸⣿⣧⠀⠘⣿⣄⠀⠀⠀⠈⠳⣄⡙⠲⢤⣄⡈⠙⠛⠻⠯⠥⢤⣄⣀⣀⣀⣀⣀⠀⠀⠀⠀⢀⣀⣠⣾⣷⣿⡇⠀⠀⠀⣾⣿⣿⡿⣿⡿⣿⡿⣿⣿⣿⣿⣿⣿⣿' ,
      \ '          ⠀⠀⠀⠀⠀⠀⣸⣿⠹⣷⡀⠸⣿⡄⠀⠀⠀⠀⠈⠙⠲⢤⣌⠉⠓⠒⠤⣤⣀⡀⠀⠉⠉⠉⠉⠉⠛⠛⣻⣿⢛⣛⣫⣽⠿⠟⠀⠀⣠⣾⣿⣿⣿⠃⣿⠑⣿⠃⣸⣿⣿⣿⣿⣿⣿' ,
      \ '          ⠀⠀⠀⠀⠀⠀⣿⣿⠀⠸⣿⣆⠹⣿⣄⠀⠀⠀⠀⠰⣄⣀⠈⠉⠓⠶⢤⣀⣀⣈⡉⠉⠉⠑⠂⠀⣈⣽⣿⣿⠿⠟⠋⠁⠀⢀⣤⣾⣿⣿⣿⣿⡏⢸⡏⢠⣿⣴⣿⣿⣿⣿⣿⣿⣿' ,
      \ '          ⡅⠀⠀⠀⢨⠀⣿⣿⠀⠀⠘⢿⡀⠀⠻⡄⠀⠀⠀⠀⠙⣿⡛⢶⣤⣤⣀⣀⠉⠉⠉⠉⠉⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⣿⣿⣿⣿⣿⣀⣼⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿' ,
      \ '          ⡇⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠹⣆⠀⠻⣆⠀⠀⠀⠀⠈⠛⠦⣬⣙⠛⣿⣿⠿⠿⠿⠗⠂⠀⠀⠀⠀⠀⢀⣠⣶⡿⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻' ,
      \ '          ⡇⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠈⢳⣄⠘⠳⣦⣄⡀⠀⠀⠀⠀⠉⠉⠉⠉⣹⠆⠀⠀⠀⠀⢀⣠⣴⣶⠟⠋⠀⣠⡾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢣⠏' ,
      \ '          ⡇⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠙⢷⣄⢸⡏⠛⠻⢶⣶⣤⣤⣤⣴⣚⣁⣀⣤⣴⣶⣿⡿⠋⠉⠁⢀⣤⣾⣫⣽⡿⠟⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⡾⠀' ,
      \ '          ⣇⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⣧⠀⠀⠀⠀⠘⠿⠍⣉⠉⠉⠉⢉⣴⡿⠋⠀⣀⣴⣾⣿⡷⠟⠋⠁⢀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠋⣸⠁⠀' ,
      \ '          ⡇⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⡇⠀⠀⠀⠀⠀⠀⣨⣀⣤⣾⣟⣡⣤⡾⠿⠟⠛⠉⢡⣄⠀⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⢰⡇⠀⠀' ,
      \ '          ⠷⠦⠴⠤⠤⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⡄⠀⠀⢀⣤⡾⠟⠛⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⠟⣹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠋⢀⡿⠀⠀⠀' 
      \ ]
highlight ExtraWhitespace ctermbg=red guibg=red
match ExtraWhitespace /\s\+$/

autocmd StdinReadPre * let s:std_in=1
autocmd VimEnter * NERDTree
autocmd VimEnter * wincmd p
autocmd BufWritePre *.js,*.jsx,*.html,*.rb,*.es6 PrettierAsync
autocmd BufWritePre * match ExtraWhitespace /\s\+$/

nmap <F1> :NERDTreeToggle<CR>

nmap <F2> :tabnext<CR>
nmap <C-T> :tabnew<CR>:NERDTreeToggle<CR>
nmap <C-Down> :m +1<CR>
nmap <C-Up> :m -2<CR>
nmap <C-U> :FloatermNew<CR>
